using System;



public enum WeaponType
{
    None = -1,

    SH1, // 새싹 슈터
    SH2, // 스플랫 슈터
    SH3, // 프라임 슈터
    SH4, // 프로모델러
    SH5, // N-ZAP
    SH6, // 볼드 마커
    SH7, // 샤프 마커
    SH8, // .52 갤런
    SH9, // .96 갤런
    SH10, // L3 릴건
    SH11, // H3 릴건
    SH12, // 제트 스위퍼
    SH13, // 보틀 가이저
    SH14, // 스페이스 슈터
    R1, // 스플랫 롤러
    R2, // 카본 롤러
    R3, // 다이너모 롤러
    R4, // 베리어블 롤러
    R5, // 와이드 롤러
    C1, // 스플랫 차저
    C2, // 스플랫 스코프
    C3, // 스퀵 클린
    C4, // 리터 4K
    C5, // 4K 스코프
    C6, // 14식 대나무 총
    C7, // 소이 튜버
    C8, // R-PEN
    BU1, // 버킷 슬로셔
    BU2, // 물통
    BU3, // 스크루 슬로셔
    BU4, // 오버플로셔
    BU5, // 익스플로셔
    BU6, // 몹링
    SP1, // 배럴 스피너
    SP2, // 스플랫 스피너
    SP3, // 하이드런트
    SP4, // 노틸러스 47
    SP5, // 쿠겔 슈라이버
    SP6, // 이그재미너
    M1, // 스플랫 머누버
    M2, // 듀얼 스위퍼
    M3, // 스퍼터리
    M4, // 쿼드 호퍼
    M5, // 켈빈 525
    M6, // 소방 FF
    U1, // 파라 셀터
    U2, // 캠핑 셀터
    U3, // 스파이 가젯
    U4, // 24식 도돌이 우산
    BL1, // 핫 블래스터
    BL2, // 롱 블래스터
    BL3, // 래피드 블래스터
    BL4, // R 블래스터 엘리트
    BL5, // 노바 블래스터
    BL6, // 크래시 블래스터
    BL7, // S-BLAST
    BT1, // 호쿠사이
    BT2, // 파블로
    BT3, // 빈센트
    H1, // 트라이 스트링거
    H2, // LACT-450
    H3, // 플루이드
    W1, // 드라이브 와이퍼
    W2, // 사무 와이퍼
    W3, // 덴탈 와이퍼
    Count,
}



public enum SoundType
{
    NextQuestion,
    eggSound,
    puuu,

}
